IdeaRS.OpenModel.Detail.TypeEdgePosition
Type edge position

IdeaRS.OpenModel.Detail.TypeEdgePosition.WholeLength
whole length

IdeaRS.OpenModel.Detail.TypeEdgePosition.PartEdge
part of the edge, mereno od pocatku hrany nebo podle zadani v jinem properties

IdeaRS.OpenModel.Detail.TypeEdgePosition.PartEdgeToEndEdge
parts of the edge to end edge - pouze na vybranem vlasniku - napriklad u linioveho zatizeni na hrane

IdeaRS.OpenModel.Detail.TypeEdgePosition.PartEdgeToSegment
parts on edge, protazene az k segmentu nebo k poslenimu pruseciku s vnejsim obrysem - napriklad u vyztuze

IdeaRS.OpenModel.Detail.TypeEdgePosition.PartEdgeFromEnd
on part of edge measured from end of the edge